In [1]:
import sqlite3 as sq3

# Create database using SQLite

In [2]:
conn = sq3.connect('INSTRUCTOR.db')
cursor = conn.cursor()

# Create a table in the database

In [3]:
cursor.execute('DROP TABLE IF EXISTS INSTRUCTOR')

In [4]:
# creating table
script = """
            CREATE TABLE IF NOT EXISTS INSTRUCTOR
            (ID INTEGER PRIMARY KEY NOT NULL,
             FNAME VARCHAR(20),
             LNAME VARCHAR(20),
             CITY VARCHAR(20),
             CCODE CHAR(2));
        """
cursor.execute(script)
print("Table is ready.")

Table is ready.

# Insert data into table

In [5]:
cursor.execute('''
                INSERT INTO INSTRUCTOR
                VALUES (1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
                ''')

In [6]:
cursor.execute('''
                INSERT INTO INSTRUCTOR VALUES 
                (2, 'Raul', 'Chong', 'Markham', 'CA'), 
                (3, 'Hima', 'Vasudevan', 'Chicago', 'US')
                ''')

# Query data in the table

In [9]:
statement = '''SELECT * FROM INSTRUCTOR'''
cursor.execute(statement)

print('All the data')
output_all = cursor.fetchall()   # fetch all rows
display(output_all)
for row in output_all:
    print(row)

All the data

[(1, 'Rav', 'Ahuja', 'TORONTO', 'CA'),
 (2, 'Raul', 'Chong', 'Markham', 'CA'),
 (3, 'Hima', 'Vasudevan', 'Chicago', 'US')]

(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

In [12]:
# fetch few rows from the table
statement = '''SELECT * FROM INSTRUCTOR'''
cursor.execute(statement)

print('All data')
output_many = cursor.fetchmany(2)    # fetch 2 rows
for row in output_many:
    print(row)

All data
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')

In [13]:
# fetch only FNAME from the table
statement = 'SELECT FNAME FROM INSTRUCTOR'
cursor.execute(statement)

print('All data')
output_col = cursor.fetchall()
for row in output_col:
    print(row)

All data
('Rav',)
('Raul',)
('Hima',)

 Write and execute an update statement that changes the Rav's CITY to MOOSETOWN

In [14]:
update = "UPDATE INSTRUCTOR SET CITY = 'MOOSETOWN' WHERE FNAME = 'Rav'"
cursor.execute(update)

output = cursor.execute('SELECT * FROM INSTRUCTOR')
for row in cursor.fetchall():
    print(row)

(1, 'Rav', 'Ahuja', 'MOOSETOWN', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

# Retrieve data in to Pandas

In [15]:
import pandas as pd
df = pd.read_sql_query('SELECT * FROM INSTRUCTOR', conn)
df

   ID FNAME      LNAME       CITY CCODE
0   1   Rav      Ahuja  MOOSETOWN    CA
1   2  Raul      Chong    Markham    CA
2   3  Hima  Vasudevan    Chicago    US

In [16]:
df.LNAME[0]

'Ahuja'

In [17]:
df.shape

(3, 5)

In [18]:
conn.close()